nilava/pixelbar/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# The SuperMini has no USB-serial bridge: the console and the flashing port are
# the C3's own USB Serial/JTAG. Keeping this on is also what frees GPIO20/21
# (UART0) for the encoder.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_HZ=1000

# Nothing in this project throws; leaving exceptions off keeps the binary small.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Over-the-air updates.
#
# The partition table has had two app slots from the start, so this costs no
# repartitioning and therefore no wiping of stored settings.
#
# Rollback is the part that matters. With it enabled the bootloader marks a
# freshly flashed slot as pending and will revert to the previous one unless
# the running firmware says it is healthy — which main.cpp only does after the
# render loop has survived for ten seconds. A build that crashes on boot
# therefore undoes itself, which is the difference between an OTA you can use
# on a device across the room and one you cannot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# A firmware image is about 875 KB over a home LAN. The default 5 s recv
# timeout ends the upload part way through on a slow link.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Bluetooth Low Energy, alongside WiFi.
#
# NimBLE rather than Bluedroid: Bluedroid is the fuller stack and roughly three
# times the flash, and there is one 1.66 MB app slot shared with WiFi, lwIP, an
# HTTP server and OTA.
#
# The C3 has one radio and one core, so WiFi and BLE take turns. Software
# coexistence is what arbitrates that; without it the two stacks fight and both
# get worse. The LED output is unaffected either way — it is DMA from SRAM once
# a frame is queued, which is the same property that made OTA survivable.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# Nothing here scans or connects outward; leaving the central roles out saves
# flash for the same reason NimBLE was chosen over Bluedroid.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
